InformationRegisters/НастройкиСтатейДоходовРасходовПоУмолчанию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиСтатейДоходовРасходовПоУмолчанию</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатьяДоходовРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяДоходовРасходовПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийСписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступлениеНаРасчетныйСчет</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийРасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийОплатаБанковскойКартой</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСтатьи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСтатейДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийПриходныйКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПриходныйКассовыйОрдер</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПодотчетника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПоставщика</Name>
					<Comment>#7080</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеКредита</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеНаличныхИзБанка</Name>
					<Comment>#12545</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыСтатейДоходовРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыСтатейДоходовРасходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийРасходныйКассовыйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРасходныйКассовыйОрдер</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВозвратКредита</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПокупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаПодотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗарплатаСотрудникам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инкассация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееСписание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийПоступлениеНаРасчетныйСчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПоступлениеНаРасчетныйСчет</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВозвратЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПоставщика</Name>
					<Comment>#7080</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнкассацияВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеКредита</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеПоБанковскимКартам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееПоступление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийСписаниеСРасчетногоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОперацийСписаниеСРасчетногоСчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВозвратКредита</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПокупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаПодотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗарплатаСотрудникам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗарплатаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнкассацияИзБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНалоговИВзносов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееСписание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/НастройкиСтатейДоходовРасходовПоУмолчанию/Ext/ManagerModule.bsl
Функция ПолучитьМассивНастроекПоУмолчанию()

	МассивНастроек = Новый Массив;
	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	ДобавитьНастройку(МассивНастроек,
		"ПриходныйКассовыйОрдер", 
		Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ОплатаОтПокупателя,
		Перечисления.ТипыСтатейДоходовРасходов.Доход,
		Справочники.СтатьиДоходовИРасходов.Продажи); 
	
	ДобавитьНастройку(МассивНастроек, 
		"ПриходныйКассовыйОрдер", 
		Перечисления.ВидыОперацийПриходныйКассовыйОрдер.Прочее, 
		Перечисления.ТипыСтатейДоходовРасходов.Доход,
		Справочники.СтатьиДоходовИРасходов.ПрочиеДоходы);
	
	ДобавитьНастройку(МассивНастроек, 
		"ПриходныйКассовыйОрдер", 
		Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ВозвратОтПодотчетника, 
		Перечисления.ТипыСтатейДоходовРасходов.Доход,
		Справочники.СтатьиДоходовИРасходов.ПрочиеДоходы);
		
	//#7080
	ДобавитьНастройку(МассивНастроек, 
		"ПриходныйКассовыйОрдер", 
		Перечисления.ВидыОперацийПриходныйКассовыйОрдер.ВозвратОтПоставщика, 
		Перечисления.ТипыСтатейДоходовРасходов.Доход,
		Справочники.СтатьиДоходовИРасходов.ВозвратДСОтПоставщика);
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	ДобавитьНастройку(МассивНастроек, 
		"РасходныйКассовыйОрдер", 
		Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ОплатаПоставщику, 
		Перечисления.ТипыСтатейДоходовРасходов.Расход, 
		Справочники.СтатьиДоходовИРасходов.Покупки); 
	
	ДобавитьНастройку(МассивНастроек, 
		"РасходныйКассовыйОрдер", 
		Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ПрочееСписание, 
		Перечисления.ТипыСтатейДоходовРасходов.Расход,
		Справочники.СтатьиДоходовИРасходов.ПрочиеРасходы);
	
	ДобавитьНастройку(МассивНастроек, 
		"РасходныйКассовыйОрдер", 
		Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ЗарплатаСотрудникам, 
		Перечисления.ТипыСтатейДоходовРасходов.Расход, 
		Справочники.СтатьиДоходовИРасходов.ЗаработнаяПлата);
	
	ДобавитьНастройку(МассивНастроек, 
		"РасходныйКассовыйОрдер", 
		Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю,
		Перечисления.ТипыСтатейДоходовРасходов.Расход, 
		Справочники.СтатьиДоходовИРасходов.ВозвратДСПокупателю);
	
	ДобавитьНастройку(МассивНастроек, 
		"РасходныйКассовыйОрдер", 
		Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВыдачаПодотчетнику, 
		Перечисления.ТипыСтатейДоходовРасходов.Расход,
		Справочники.СтатьиДоходовИРасходов.ПрочиеРасходы);
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	ДобавитьНастройку(МассивНастроек, 
		"ЗаявкаНаРасходованиеДенежныхСредств", 
		Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ОплатаПоставщику, 
		Перечисления.ТипыСтатейДоходовРасходов.Расход, 
		Справочники.СтатьиДоходовИРасходов.Покупки); 
	
	ДобавитьНастройку(МассивНастроек, 
		"ЗаявкаНаРасходованиеДенежныхСредств", 
		Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ПрочееСписание, 
		Перечисления.ТипыСтатейДоходовРасходов.Расход, 
		Справочники.СтатьиДоходовИРасходов.ПрочиеРасходы);
	
	ДобавитьНастройку(МассивНастроек, 
		"ЗаявкаНаРасходованиеДенежныхСредств", 
		Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ЗарплатаСотрудникам, 
		Перечисления.ТипыСтатейДоходовРасходов.Расход, 
		Справочники.СтатьиДоходовИРасходов.ЗаработнаяПлата);
	
	ДобавитьНастройку(МассивНастроек, 
		"ЗаявкаНаРасходованиеДенежныхСредств", 
		Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВозвратПокупателю,
		Перечисления.ТипыСтатейДоходовРасходов.Расход, 
		Справочники.СтатьиДоходовИРасходов.ВозвратДСПокупателю);
	
	ДобавитьНастройку(МассивНастроек, 
		"ЗаявкаНаРасходованиеДенежныхСредств", 
		Перечисления.ВидыОперацийРасходныйКассовыйОрдер.ВыдачаПодотчетнику, 
		Перечисления.ТипыСтатейДоходовРасходов.Расход, 
		Справочники.СтатьиДоходовИРасходов.ПрочиеРасходы);
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	ДобавитьНастройку(МассивНастроек, 
		"ПоступлениеНаРасчетныйСчет", 
		Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ОплатаОтПокупателя, 
		Перечисления.ТипыСтатейДоходовРасходов.Доход,
		Справочники.СтатьиДоходовИРасходов.Продажи); 
	
	ДобавитьНастройку(МассивНастроек, 
		"ПоступлениеНаРасчетныйСчет", 
		Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ПрочееПоступление, 
		Перечисления.ТипыСтатейДоходовРасходов.Доход,
		Справочники.СтатьиДоходовИРасходов.ПрочиеДоходы);
	
	ДобавитьНастройку(МассивНастроек, 
		"ПоступлениеНаРасчетныйСчет", 
		Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ПоступлениеПоБанковскимКартам,
		Перечисления.ТипыСтатейДоходовРасходов.Доход, 
		Справочники.СтатьиДоходовИРасходов.Продажи);
	
	ДобавитьНастройку(МассивНастроек, 
		"ПоступлениеНаРасчетныйСчет", 
		Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ПоступлениеПоБанковскимКартам,
		Перечисления.ТипыСтатейДоходовРасходов.Расход,
		Справочники.СтатьиДоходовИРасходов.ПрочиеРасходы);
		
	//#7080
	ДобавитьНастройку(МассивНастроек, 
		"ПоступлениеНаРасчетныйСчет", 
		Перечисления.ВидыОперацийПоступлениеНаРасчетныйСчет.ВозвратОтПоставщика, 
		Перечисления.ТипыСтатейДоходовРасходов.Доход,
		Справочники.СтатьиДоходовИРасходов.ВозвратДСОтПоставщика);
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	ДобавитьНастройку(МассивНастроек, 
		"СписаниеСРасчетногоСчета", 
		Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ОплатаПоставщику, 
		Перечисления.ТипыСтатейДоходовРасходов.Расход,
		Справочники.СтатьиДоходовИРасходов.Покупки); 
	
	ДобавитьНастройку(МассивНастроек, 
		"СписаниеСРасчетногоСчета", 
		Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ПрочееСписание, 
		Перечисления.ТипыСтатейДоходовРасходов.Расход,
		Справочники.СтатьиДоходовИРасходов.ПрочиеРасходы);
	
	ДобавитьНастройку(МассивНастроек, 
		"СписаниеСРасчетногоСчета", 
		Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотрудникам, 
		Перечисления.ТипыСтатейДоходовРасходов.Расход,
		Справочники.СтатьиДоходовИРасходов.ЗаработнаяПлата);
	
	ДобавитьНастройку(МассивНастроек, 
		"СписаниеСРасчетногоСчета", 
		Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ПеречислениеНалоговИВзносов,
		Перечисления.ТипыСтатейДоходовРасходов.Расход,
		Справочники.СтатьиДоходовИРасходов.Налоги);
		
	ДобавитьНастройку(МассивНастроек, 
		"СписаниеСРасчетногоСчета", 
		Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВыдачаПодотчетнику, 
		Перечисления.ТипыСтатейДоходовРасходов.Расход,
		Справочники.СтатьиДоходовИРасходов.ПрочиеРасходы);
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	ДобавитьНастройку(МассивНастроек, 
		"ПлатежноеПоручениеИсходящее", 
		Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ОплатаПоставщику, 
		Перечисления.ТипыСтатейДоходовРасходов.Расход,
		Справочники.СтатьиДоходовИРасходов.Покупки); 
	
	ДобавитьНастройку(МассивНастроек, 
		"ПлатежноеПоручениеИсходящее", 
		Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ПрочееСписание, 
		Перечисления.ТипыСтатейДоходовРасходов.Расход,
		Справочники.СтатьиДоходовИРасходов.ПрочиеРасходы);
	
	ДобавитьНастройку(МассивНастроек, 
		"ПлатежноеПоручениеИсходящее", 
		Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотрудникам, 
		Перечисления.ТипыСтатейДоходовРасходов.Расход,
		Справочники.СтатьиДоходовИРасходов.ЗаработнаяПлата);
	
	ДобавитьНастройку(МассивНастроек, 
		"ПлатежноеПоручениеИсходящее", 
		Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ПеречислениеНалоговИВзносов,
		Перечисления.ТипыСтатейДоходовРасходов.Расход,
		Справочники.СтатьиДоходовИРасходов.Налоги);
		
	ДобавитьНастройку(МассивНастроек, 
		"ПлатежноеПоручениеИсходящее", 
		Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВыдачаПодотчетнику, 
		Перечисления.ТипыСтатейДоходовРасходов.Расход,
		Справочники.СтатьиДоходовИРасходов.ПрочиеРасходы);
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	ДобавитьНастройку(МассивНастроек, 
		"ЗаявкаНаРасходованиеДенежныхСредств", 
		Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ОплатаПоставщику, 
		Перечисления.ТипыСтатейДоходовРасходов.Расход, 
		Справочники.СтатьиДоходовИРасходов.Покупки); 
	
	ДобавитьНастройку(МассивНастроек, 
		"ЗаявкаНаРасходованиеДенежныхСредств", 
		Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ПрочееСписание, 
		Перечисления.ТипыСтатейДоходовРасходов.Расход, 
		Справочники.СтатьиДоходовИРасходов.ПрочиеРасходы);
	
	ДобавитьНастройку(МассивНастроек, 
		"ЗаявкаНаРасходованиеДенежныхСредств", 
		Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ЗарплатаСотрудникам, 
		Перечисления.ТипыСтатейДоходовРасходов.Расход, 
		Справочники.СтатьиДоходовИРасходов.ЗаработнаяПлата);
	
	ДобавитьНастройку(МассивНастроек, 
		"ЗаявкаНаРасходованиеДенежныхСредств", 
		Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ПеречислениеНалоговИВзносов,
		Перечисления.ТипыСтатейДоходовРасходов.Расход, 
		Справочники.СтатьиДоходовИРасходов.Налоги);
		
	ДобавитьНастройку(МассивНастроек, 
		"ЗаявкаНаРасходованиеДенежныхСредств", 
		Перечисления.ВидыОперацийСписаниеСРасчетногоСчета.ВыдачаПодотчетнику, 
		Перечисления.ТипыСтатейДоходовРасходов.Расход, 
		Справочники.СтатьиДоходовИРасходов.ПрочиеРасходы);
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	//#11129 закомментировано
	//ДобавитьНастройку(МассивНастроек, 
	//	"ОплатаБанковскойКартой", 
	//	Перечисления.ВидыОперацийОплатаБанковскойКартой.ОплатаБанковскойКартой,
	//	Перечисления.ТипыСтатейДоходовРасходов.Доход, 
	//	Справочники.СтатьиДоходовИРасходов.Продажи); 
	//
	//ДобавитьНастройку(МассивНастроек, 
	//	"ОплатаБанковскойКартой", 
	//	Перечисления.ВидыОперацийОплатаБанковскойКартой.Кредит,
	//	Перечисления.ТипыСтатейДоходовРасходов.Доход, 
	//	Справочники.СтатьиДоходовИРасходов.Продажи);
	//
	//ДобавитьНастройку(МассивНастроек, 
	//	"ОплатаБанковскойКартой", 
	//	Перечисления.ВидыОперацийОплатаБанковскойКартой.ВозвратОплатыКлиенту,
	//	Перечисления.ТипыСтатейДоходовРасходов.Расход, 
	//	Справочники.СтатьиДоходовИРасходов.ВозвратДСПокупателю);
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	ДобавитьНастройку(МассивНастроек, 
		"ПоступлениеТоваровИУслуг", 
		Неопределено, 
		Перечисления.ТипыСтатейДоходовРасходов.Расход, 
		Справочники.СтатьиДоходовИРасходов.Покупки); 
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	ДобавитьНастройку(МассивНастроек, 
		"РеализацияТоваровИУслуг", 
		Неопределено, 
		Перечисления.ТипыСтатейДоходовРасходов.Доход, 
		Справочники.СтатьиДоходовИРасходов.Продажи); 
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	ДобавитьНастройку(МассивНастроек, 
		"ВозвратТовараОтПокупателя", 
		Неопределено, 
		Перечисления.ТипыСтатейДоходовРасходов.Расход, 
		Справочники.СтатьиДоходовИРасходов.ВозвратОтПокупателя); 
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	ДобавитьНастройку(МассивНастроек, 
		"ВозвратТовараПоставщику", 
		Неопределено, 
		Перечисления.ТипыСтатейДоходовРасходов.Доход, 
		Справочники.СтатьиДоходовИРасходов.ВозвратПоставщику); 
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	ДобавитьНастройку(МассивНастроек, 
		"СписаниеТоваров", 
		Неопределено, 
		Перечисления.ТипыСтатейДоходовРасходов.Расход, 
		Справочники.СтатьиДоходовИРасходов.СписаниеТоваров); 
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	ДобавитьНастройку(МассивНастроек, 
		"ОприходованиеТоваров", 
		Неопределено, 
		Перечисления.ТипыСтатейДоходовРасходов.Доход,
		Справочники.СтатьиДоходовИРасходов.ОприходованиеТоваров);	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	ДобавитьНастройку(МассивНастроек, 
		"ВозвратПродукции",
		"Доход", 
		Перечисления.ТипыСтатейДоходовРасходов.Доход, 
		Справочники.СтатьиДоходовИРасходов.ПрочиеДоходы);	
	
	ДобавитьНастройку(МассивНастроек, 
		"ВозвратПродукции", 
		"Расход", 
		Перечисления.ТипыСтатейДоходовРасходов.Расход, 
		Справочники.СтатьиДоходовИРасходов.ПрочиеРасходы);	
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	ДобавитьНастройку(МассивНастроек, 
		"Замена", 
		"Доход", 
		Перечисления.ТипыСтатейДоходовРасходов.Доход, 
		Справочники.СтатьиДоходовИРасходов.ПрочиеДоходы);	
	
	ДобавитьНастройку(МассивНастроек, 
		"Замена", 
		"Расход", 
		Перечисления.ТипыСтатейДоходовРасходов.Расход, 
		Справочники.СтатьиДоходовИРасходов.ПрочиеРасходы);
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	ДобавитьНастройку(МассивНастроек, 
		"АвансовыйОтчет", 
		Неопределено, 
		Перечисления.ТипыСтатейДоходовРасходов.Расход, 
		Справочники.СтатьиДоходовИРасходов.ПрочиеРасходы);
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	ДобавитьНастройку(МассивНастроек, 
		"Монтаж", 
		"Доход", 
		Перечисления.ТипыСтатейДоходовРасходов.Доход, 
		Справочники.СтатьиДоходовИРасходов.Продажи);
	
	ДобавитьНастройку(МассивНастроек, 
		"Монтаж", 
		"Расход", 
		Перечисления.ТипыСтатейДоходовРасходов.Расход, 
		Справочники.СтатьиДоходовИРасходов.ПрочиеРасходы);
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	ДобавитьНастройку(МассивНастроек, 
		"НачислениеЗарплаты", 
		Неопределено,
		Перечисления.ТипыСтатейДоходовРасходов.Расход,
		Справочники.СтатьиДоходовИРасходов.ЗаработнаяПлата);
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	ДобавитьНастройку(МассивНастроек, 
		"Штраф", 
		Неопределено, 
		Перечисления.ТипыСтатейДоходовРасходов.Доход,
		Справочники.СтатьиДоходовИРасходов.ПрочиеДоходы);
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// №6303 добавлен документ СоглашениеОРасторженииДоговора
	ДобавитьНастройку(МассивНастроек, 
		"СоглашениеОРасторженииДоговора", 
		"Доход", 
		Перечисления.ТипыСтатейДоходовРасходов.Доход, 
		Справочники.СтатьиДоходовИРасходов.ПрочиеДоходы);
	
	ДобавитьНастройку(МассивНастроек, 
		"СоглашениеОРасторженииДоговора", 
		"Расход", 
		Перечисления.ТипыСтатейДоходовРасходов.Расход, 
		Справочники.СтатьиДоходовИРасходов.ПрочиеРасходы);
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////
	ДобавитьНастройку(МассивНастроек, 
		"ЗаявкаНаДоставку", 
		"Расход", 
		Перечисления.ТипыСтатейДоходовРасходов.Расход,
		Справочники.СтатьиДоходовИРасходов.ПрочиеРасходы);
	///////////////////////////////////////////////////////////////////////////////////////////////////////////////		
	Возврат МассивНастроек;
	
КонецФункции

Процедура ЗаполнитьНастройкиПоУмолчанию(ПерезаполнитьВесьРегистр = Ложь) Экспорт
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьВедениеУчетаДоходовРасходов") Тогда
		Возврат;
	КонецЕсли;
	
	Если ПерезаполнитьВесьРегистр Тогда
		НаборЗаписей = РегистрыСведений.НастройкиСтатейДоходовРасходовПоУмолчанию.СоздатьНаборЗаписей();
		НаборЗаписей.Записать();
	КонецЕсли;
	
	МассивНастроек = ПолучитьМассивНастроекПоУмолчанию();
	Для каждого ЭлементМассива из МассивНастроек Цикл
		ДобавитьОбновитьЗапись(ЭлементМассива.ТипДокумента, ЭлементМассива.ВидОперации, ЭлементМассива.ТипСтатьи, ЭлементМассива.Статья)	
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьНастройку(МассивНастроек, ТипДокумента, ВидОперации, ТипСтатьи, Статья)
	
	МассивНастроек.Добавить(Новый Структура("ТипДокумента, ВидОперации, ТипСтатьи, Статья", ТипДокумента, ВидОперации, ТипСтатьи, Статья)); 
	
КонецПроцедуры

Процедура ДобавитьОбновитьЗапись(ТипДокумента, ВидОперации, ТипСтатьи, Статья)

	НаборЗаписей = РегистрыСведений.НастройкиСтатейДоходовРасходовПоУмолчанию.СоздатьНаборЗаписей();	
	НаборЗаписей.Отбор.ТипДокумента.Установить(ТипДокумента);
	НаборЗаписей.Отбор.ВидОперации.Установить(ВидОперации);
	//НаборЗаписей.Прочитать();
	//НаборЗаписей.Записать(); // для заполнения измерения ТипСтатьи в модуле набора записей
	НаборЗаписей.Отбор.ТипСтатьи.Установить(ТипСтатьи);
	НаборЗаписей.Прочитать();
		
	Если НаборЗаписей.Количество() = 0 Тогда			
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.ТипДокумента 			= ТипДокумента; 
		НоваяЗапись.ВидОперации 			= ВидОперации; 
		//НоваяЗапись.УДАЛИТЬ_ЭтоДоход 		= ЭтоДоход;
		НоваяЗапись.ТипСтатьи 				= ТипСтатьи;
		НоваяЗапись.СтатьяДоходовРасходов 	= Статья;
		НоваяЗапись.СтатьяДоходовРасходовПоУмолчанию = Статья;
		НаборЗаписей.Записать();
	КонецЕсли;	
		
КонецПроцедуры

//для процедуры обновления 2.0
Процедура ЗаполнитьИзмерениеТипСтатьи() Экспорт
	
	НаборЗаписей = РегистрыСведений.НастройкиСтатейДоходовРасходовПоУмолчанию.СоздатьНаборЗаписей();	
	НаборЗаписей.Прочитать(); 	
	НаборЗаписей.Записать(); // заполнения измерения ТипСтатьи происходит в модуле набора записей
	
КонецПроцедуры

Процедура ЗаполнитьРесурсСтатьяПоУмолчанию() Экспорт
	
	МассивНастроек = ПолучитьМассивНастроекПоУмолчанию();
	Для каждого ЭлементМассива из МассивНастроек Цикл
	
		НаборЗаписей = РегистрыСведений.НастройкиСтатейДоходовРасходовПоУмолчанию.СоздатьНаборЗаписей();	
		НаборЗаписей.Отбор.ТипДокумента.Установить(ЭлементМассива.ТипДокумента);
		НаборЗаписей.Отбор.ВидОперации.Установить(ЭлементМассива.ВидОперации);
		НаборЗаписей.Отбор.ТипСтатьи.Установить(ЭлементМассива.ТипСтатьи);
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() > 0 Тогда			
			НаборЗаписей[0].СтатьяДоходовРасходовПоУмолчанию = ЭлементМассива.Статья;
			НаборЗаписей.Записать();
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры
